#### CreateSingleCategorySchedule Method

---

|  |
| --- |
| AssemblyViewUtils Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreateSingleCategorySchedule(Document, ElementId, ElementId) | Creates a new single-category schedule assembly view for the assembly instance. |
| Public method Static member | CreateSingleCategorySchedule(Document, ElementId, ElementId, ElementId, Boolean) | Creates a new single-category schedule assembly view for the assembly instance. |

# See Also

AssemblyViewUtils Class

AssemblyViewUtils Members

Autodesk.Revit.DB Namespace